Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
#include <spidermeshapi.h>
#include "esp32-hal-uart.h"
#include "soc/uart_struct.h"

#ifndef THREAD_DELAY_WINDOW
	#define THREAD_DELAY_WINDOW 100
#endif

portMUX_TYPE SpidermeshApi::mutexExpect;


mesh_t::iterator SpidermeshApi::gateway;
mesh_t SpidermeshApi::gateway_boot;
std::list<ExpectAnswer> SpidermeshApi::listOfExpectedAnswer;
bool SpidermeshApi::gatewayMacAddressIsReceived=false;

SmkList SpidermeshApi::nodes;
ExpectCallback SpidermeshApi::cbAutomaticPolling;
ExpectCallback SpidermeshApi::cb_automatic_polling_failed;
RequestBuilderCallback SpidermeshApi::cbAutoRequestBuilder;
unsigned char SpidermeshApi::state_serial;
mesh_t::iterator SpidermeshApi::pCurrentNode;

bool SpidermeshApi::_auto_polling_mode;
String SpidermeshApi::polling_mode;


uint16_t SpidermeshApi::length_packet;
unsigned char SpidermeshApi::idx_buf;

int SpidermeshApi::eob_cnt;
byte SpidermeshApi::channel_rf;
firmware_t SpidermeshApi::firmware;

apiframe SpidermeshApi::current_packet;
std::function<void(apiframe)> SpidermeshApi::cbWhenPacketReceived;
std::function<void(apiframe)> SpidermeshApi::cbWhenPacketSent;
std::function<bool(bool)> SpidermeshApi::WhenEobIsReceived;
uint32_t SpidermeshApi::focus_node;
unsigned long SpidermeshApi::focus_node_start_time;
uint16_t SpidermeshApi::_duration_focus_on_node_polling;

bool SpidermeshApi::special_op_done = false;


//std::vector <mesh_t::iterator> SpidermeshApi::otaList;

bool SpidermeshApi::enable_terminal_record;
std::list<String> SpidermeshApi::terminalBuffer;
long SpidermeshApi::timeout_expect;
unsigned long SpidermeshApi::previousMillisExpectPacketReceived;
bool SpidermeshApi::watchdog_serial_parser;
unsigned long SpidermeshApi::previousMillisPacketParser;
uint8_t SpidermeshApi::idx_polling_cnt;


WriteAndExpectList_t SpidermeshApi::writeAndExpectList;
commandList_t SpidermeshApi::lowPriorityFifoCommandList;
commandList_t SpidermeshApi::highPriorityFifoCommandList;

bool SpidermeshApi::show_eob = false;
bool SpidermeshApi::show_apipkt_in = false;
bool SpidermeshApi::show_apipkt_out = false;


MeshParam SpidermeshApi::actualMeshSpeed;
MeshParam SpidermeshApi::requiredMeshSpeed;
uint64_t SpidermeshApi::timeCallbackUser;

HardwareSerial SpidermeshApi::smkport(2);



SpidermeshApi::SpidermeshApi()
{
    pinMode(CTS_PORTIA, INPUT);

    digitalWrite(RESET_PORTIA,HIGH);
    pinMode(RESET_PORTIA, OUTPUT);
    #if PORTIA_RESET_WHEN_ESP32_REBOOT
    digitalWrite(RESET_PORTIA,LOW);
    delay(500);
    digitalWrite(RESET_PORTIA,HIGH);
    #endif
    state_serial = STATE_SOF;
    timeout_expect = 10000;
    previousMillisExpectPacketReceived = 0;
    watchdog_serial_parser = false;
    previousMillisPacketParser = 0;
    idx_buf = 0;


    cbAutoRequestBuilder = RequestBuilderCallback([](mesh_t::iterator pNode) -> apiframe{apiframe x; return x;});

    //Serial.println("Serial port configured");

    length_packet = 0;
    idx_polling_cnt=0;

    mutexExpect = portMUX_INITIALIZER_UNLOCKED;
    enable_terminal_record = false;
}

bool SpidermeshApi::init()
{

    Serial.print("Serial port... ");
    


    // CONFIG SERIAL PORT WITH CTS HARDWARE FLOW CONTROL
    // HardwareSerial smkport(2);
    // HardwareSerial* port_smk=&smkport;

    // ATTACH portia CTS to U2CTS_in at digital 33
    // see table 19 page 54 esp32 technical reference manual 
    // choose the function attach to the digital pin
    // here this is U2CTS_in so 199 attach to pin 33
    // last parameter is for inversion of CTS signal which not in this case so false
    // https://www.espressif.com/sites/default/files/documentation/esp32_technical_reference_manual_en.pdf


    // ENABLE AUTOMATIC HARDWARE FLOW CONTROL
    // this is in the register conf0 of the serial port. (see register 14.9 page 362)
    // this register is the second parameter of the begin function that set normaly only parity and payload size
    // in the include file is a struct of this register.
    // use it to enable the TX flow control bit
    // https://www.espressif.com/sites/default/files/documentation/esp32_technical_reference_manual_en.pdf
    // uart_dev_t uart_registers;
    // uart_registers.conf0.val=SERIAL_8N1;
    // uart_registers.conf0.tx_flow_en=1;

    smkport.begin(PORTIA_BAUDRATE, SERIAL_8N1, RX_PORTIA, TX_PORTIA);
    pinMatrixInAttach(33, 199, false);
    smkport.setPins(RX_PORTIA,TX_PORTIA,CTS_PORTIA, -1);
    smkport.setHwFlowCtrlMode(HW_FLOWCTRL_CTS);


    //Sderial2.begin(PORTIA_BAUDRATE, uart_registers.conf0.val, RX_PORTIA, TX_PORTIA);
    //Sderial.println(" OK");


    //PRTLN(" before init smk900"); delay(10);


    //Serial.println("Init portia done");

    //creation of the jsonbuffer into the psram, since it is a large chunck
    nodes.type_json = new DynamicJsonDocument (SIZE_OF_DYNAMIC_JSON_TYPE);
    return true;
}



void SpidermeshApi::reset()
{
    digitalWrite(RESET_PORTIA,LOW);
    delay(1000);
    digitalWrite(RESET_PORTIA,HIGH);
    delay(100);
}


void SpidermeshApi::write(uint32_t c)
{
    smkport.write(c);
}
void SpidermeshApi::write32(uint32_t c)
{
    u_bytes u;
    u.uint32b = c;

    smkport.write(u.uint8b[0]);
    smkport.write(u.uint8b[1]);
    smkport.write(u.uint8b[2]);
    smkport.write(u.uint8b[3]);
}

void SpidermeshApi::SaveGatewayMacAddress(apiframe packet)
{
    //Serial.println("EOB packet");
    IPAddress RepliedMacAddress = {packet[10], packet[9], packet[8], packet[7]}; 
    #if SHOW_EXPECT_EVENT || SHOW_MIN_DEBUG
    Serial.println("Gateway MAC address: " + RepliedMacAddress.toString());
    #endif

     SmkNode g;
    g.mac.bOff[byte0] = RepliedMacAddress[3];
    g.mac.bOff[byte1] = RepliedMacAddress[2];
    g.mac.bOff[byte2] = RepliedMacAddress[1];
    g.mac.bOff[byte3] = RepliedMacAddress[0];
    /*
    if(gateway.size()==0)
    {   
        gateway.insert(std::make_pair(a,g));
    }
    */
    gatewayMacAddressIsReceived=true;
}


apiframe SpidermeshApi::localSetRegister(uint8_t offset_register, uint8_t size_register, uint8_t *content)
{
    uint8_t cmd[20] = {0xFB, 0, 0, 4, 0, offset_register, size_register};
    memcpy(cmd+7, content, size_register);
    uint8_t len = size_register + 4;
    cmd[1] = len;

    apiframe ret;
    for(int i=0; i<len+3; i++)
    {
        ret.push_back(cmd[i]);
    } 
    return ret;
}

apiframe SpidermeshApi::localTransfertConfigFromRAMBUFF(uint8_t location)
{
    uint8_t cmd[5] = {0xFB, 2, 0, 0x0B, location};

    apiframe ret;

