Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
        #if 0
            char msg[100];
            sprintf(msg, "Bo:%d\nBi:%d\nHops:%d\nR:%d\nRe:%d\nDuty:%d\n",actualMeshSpeed.bo,actualMeshSpeed.bi,actualMeshSpeed.hop,actualMeshSpeed.rde,actualMeshSpeed.rd,actualMeshSpeed.duty);
            Serial.print(msg);

            Serial.print("tBroadcast:");
            Serial.println(tBroadcast);
            Serial.print("tInterval:");
            Serial.println(tInterval);
            Serial.print("tSleep:");
            Serial.println(tSleep);
        #endif
        #if 1
            Serial.print("  secureSleep:");
            Serial.println(secureSleep);
            Serial.print("  timeCallbackUser:");
            Serial.println(timeCallbackUser);
        #endif


        int remaining = secureSleep;
        do
        {
            delay(100);
            remaining -=100;
            int av = smkport.available();
            if(av) 
            {
                Serial.printf("nb av:%d\n", av);
                break;    
            }
        } while (remaining>0);
    }
}

//------------------------------------------------------------------------------------------------
bool SpidermeshApi::TimmingMeshCalculator(int* tbroadcat, int* tinterval, int* tsleep)
{
    bool ret = false;
    if(actualMeshSpeed.hop != 0)
    {

        *tbroadcat = 10 * (actualMeshSpeed.hop * (actualMeshSpeed.bo + actualMeshSpeed.bi) + actualMeshSpeed.rde *actualMeshSpeed.rd);
        *tinterval = *tbroadcat * actualMeshSpeed.duty;
        *tsleep = *tinterval - *tbroadcat;
        ret = true;
    }
    return ret;
}

//------------------------------------------------------------------------------------------------
void SpidermeshApi::parseApiFromHost(uint8_t* buf, uint16_t len)
{
    uint16_t id_pkt = 0;
    uint8_t state_pkt = STATE_SOF;
    static uint16_t len_pkt;
    uint16_t last_idx_packet = 0;
    commandList_t cmd_list_ok;
    apiframe cmd_pkt;


    while(id_pkt < len)
    {
        switch (state_pkt)
        {
            case STATE_SOF:
                if (buf[id_pkt] == 0xFB)
                {
                    state_pkt = STATE_LENGTH;
                    len_pkt = 0;
                    cmd_pkt.push_back(buf[id_pkt]);
                }
                id_pkt++;
                break;
            case STATE_LENGTH:
                if (len_pkt == 0){
                    cmd_pkt.push_back(buf[id_pkt]);
                    len_pkt += buf[id_pkt];
                }
                else
                { 
                    cmd_pkt.push_back(buf[id_pkt]);
                    len_pkt += ((uint16_t)buf[id_pkt])*256;
                    state_pkt = STATE_DATA; 
                }
                id_pkt++;
                break;
            case STATE_DATA:
                //read serial port char
                cmd_pkt.push_back(buf[id_pkt]);
                id_pkt++;
                
                //Lenght of packet reach, packet ready to parse
                if (id_pkt-last_idx_packet >= len_pkt+3)
                {
                    last_idx_packet= id_pkt;
                    addApiPacketLowPriority(cmd_pkt);

                    //Serial.println("  will be sent");
                    cmd_pkt.clear();
                    state_pkt = STATE_SOF;
                }
                break;

            default:
                state_pkt = STATE_SOF;
                break;
        }
    }

}





//-------------------------------
String SpidermeshApi::sendCommand(apiframe cmd)
{
    for (int i = 0; i < cmd.size(); i++){
        write(cmd[i]);
    }
    if(cbWhenPacketSent)cbWhenPacketSent(cmd);


    String cmd_out = hexPacketToAscii(cmd);
    #if SHOW_TRANSMITED_PACKET_TO_SMK900
    printApiPacket(cmd, "out: ");    
    //Serial.println(cmd_out);
    #endif
    if(enable_terminal_record) AddToTerminalBuffer("out:", &cmd);

    return cmd_out;
}

void SpidermeshApi::AddToTerminalBuffer(String head, apiframe *cmd)
{
    terminalBuffer.push_back(head +  hexPacketToAscii(*cmd));

    if (terminalBuffer.size() > NB_PACKET_TERMINAL)
        terminalBuffer.pop_front();    


}

bool SpidermeshApi::sendNextPacketBuffered(bool eob)
{
    bool remote_op_done = false;
    bool appreq = false;

    //check if there is already an app request here, if so, we don't want send anything else
    //taskENTER_CRITICAL(&mutexExpect);
    for(auto e:listOfExpectedAnswer) if(e._tag == "appreq") return true;
    //taskEXIT_CRITICAL(&mutexExpect);

    if (writeAndExpectList.size()>0 || lowPriorityFifoCommandList.size() > 0 || highPriorityFifoCommandList.size() > 0)
    {
        //send the command
    #if SHOW_TRANSMITED_PACKET_TO_SMK900 && 0
        Serial.print("on demand cmd sent: ");
    #endif
        apiframe cmd;
        if(writeAndExpectList.size()>0)
        {
            auto x = writeAndExpectList.begin();
            while(x != writeAndExpectList.end())
            {
                if(x->tag == "appreq") break;
                x++;
            }

            if(x == writeAndExpectList.end()) x = writeAndExpectList.begin();

            if(x->payload[3]==PACKET_TXAIR_CMD_WRAPPER) 
            {
                if(eob)
                {
                    cmd = x->payload;
                    remote_op_done = true;
                    WriteAndExpectAnwser(x->pNode, x->payload, x->tag, x->callback);
                    writeAndExpectList.erase(x);
                }
                
            }
            else{
                cmd = x->payload;
                WriteAndExpectAnwser(x->pNode, x->payload, x->tag, x->callback);
                writeAndExpectList.erase(x);
            }
        }
        else if(highPriorityFifoCommandList.size() > 0)
        {
            cmd = highPriorityFifoCommandList.front();
            if(cmd[3]==PACKET_TXAIR_CMD_WRAPPER)
                highPriorityFifoCommandList.pop_front();
            sendCommand(cmd);
        }
        else if(lowPriorityFifoCommandList.size() > 0)
        {
            cmd = lowPriorityFifoCommandList.front();
            if(cmd[3]==PACKET_TXAIR_CMD_WRAPPER) remote_op_done = true;
            lowPriorityFifoCommandList.pop_front();
            sendCommand(cmd);
        }

        if(show_apipkt_out)
        {
            String prefix = "  out: ";
            if(cmd.size()>5)if(cmd[5] == 0x4E) prefix = "  broadcast: ";
            printApiPacket(cmd, prefix);
        }
    }
    

    return remote_op_done;
}

