Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
void SpidermeshApi::ClearFifoAndExpectList()
{
    taskENTER_CRITICAL(&mutexExpect);
    writeAndExpectList.clear();
    lowPriorityFifoCommandList.clear();
    highPriorityFifoCommandList.clear();
    taskEXIT_CRITICAL(&mutexExpect);
    dumpReceivedBuffer();
}



bool SpidermeshApi::addWriteExpect(mesh_t::iterator p, apiframe h, String t, ExpectCallback cb)
{
    MeshRequest_t req = {p, h, cb, t};
    taskENTER_CRITICAL(&mutexExpect);
    writeAndExpectList.push_back(req);
    taskEXIT_CRITICAL(&mutexExpect);
    return true;
}

bool SpidermeshApi::addApiPacketLowPriority(String asciiCommand)
{

    apiframe od_pkt = convertAsciiTohexCommand(asciiCommand.c_str());
    //printApiPacket(od_pkt);
    addApiPacketLowPriority(od_pkt);
    return true;
}

bool SpidermeshApi::addApiPacketLowPriority(uint8_t* buffer, int size)
{
    apiframe buf_hex;
    for(int i=0; i<size;i++)
    {
        buf_hex.push_back(buffer[i]);
    }
    addApiPacketLowPriority(buf_hex);
    return true;
}

bool SpidermeshApi::addApiPacketLowPriority(apiframe hcmd)
{
    taskENTER_CRITICAL(&mutexExpect);
    if(lowPriorityFifoCommandList.size() <= PORTIA_FIFO_LOW_PRIORITY_SIZE)
    {
#if ON_DEMAND_COMMAND_MUST_BE_DIFFERENT_FROM_THE_LAST_ONE == 1
        if(hcmd != lowPriorityFifoCommandList.back())
        {
            lowPriorityFifoCommandList.push_back(hcmd);
            return true;
        }
        else
        {
            Serial.println("Exact same command is present in the list so we discard the newest one");
        }
#else
        lowPriorityFifoCommandList.push_back(hcmd);
#endif
    }
    else
    {
        Serial.println("maximum FIFO size reached!");
    }
    taskEXIT_CRITICAL(&mutexExpect);

    return false;
}


bool SpidermeshApi::addApiPacketHighPriority(apiframe hcmd)
{
    taskENTER_CRITICAL(&mutexExpect);
    if(highPriorityFifoCommandList.size() <= PORTIA_FIFO_HIGH_PRIORITY_SIZE)
    {
    #if ON_DEMAND_COMMAND_MUST_BE_DIFFERENT_FROM_THE_LAST_ONE == 1
        if(hcmd != highPriorityFifoCommandList.back())
        {
            highPriorityFifoCommandList.push_back(hcmd);
        }
    #else
        highPriorityFifoCommandList.push_back(hcmd);
    #endif
        return true;
    }
    taskEXIT_CRITICAL(&mutexExpect);

    return false;
}



void SpidermeshApi::WriteAndExpectAnwser(mesh_t::iterator pNode, apiframe request, String tag, ExpectCallback cb)
{
    uint max_retry = DEFAULT_MAX_TRY_TO_SEND;
    apiframe expectPayload;
    int16_t size = -1;

    WriteAndExpectAnwser(pNode,request,max_retry,expectPayload, size, tag, cb);
}
void SpidermeshApi::WriteAndExpectAnwser(mesh_t::iterator pNode, apiframe request, uint8_t max_retry, String tag,ExpectCallback cb)
{
    apiframe expectPayload;
    int16_t size = -1;

    WriteAndExpectAnwser(pNode,request,max_retry,expectPayload, size, tag, cb);
}

void SpidermeshApi::WriteAndExpectAnwser(  mesh_t::iterator pNode, 
                                    apiframe request,                                   
                                    uint8_t max_retry, 
                                    apiframe expectPayload, 
                                    int16_t size, 
                                    String tag,
                                    ExpectCallback cb)
{
  #if SHOW_EXPECT_EVENT
    Serial.println("SHOW_EXPECT_EVENT");
  #endif
    
    //check if not already exist
    bool found = false;
    for (auto i:listOfExpectedAnswer)
    {
        if ( i._pNode == pNode && i._request == request && i._tag == tag){
            found = true;
            printf("%sFOUND%s", KRED, KNRM);
            break;
        } 
    }

    #define MAX_EXPECT_LIST 10
    if(1)//!found)
    {
        if(listOfExpectedAnswer.size() < MAX_EXPECT_LIST)
        {


            ExpectAnswer toWaitAnswerElem(pNode, request, cb, tag, max_retry, expectPayload, size);
            listOfExpectedAnswer.push_back(toWaitAnswerElem);
            sendCommand(request);
        }
        else PRTLN("MAX_EXPECT_LIST reached");
    }
}


#define EN_MUTEX_EXPECT true
void SpidermeshApi::CheckIfAnswerWasExpectedAndCallSuccessFunction(apiframe rxPkt)
{
  #if SHOW_EXPECT_EVENT
    Serial.println("CheckIfAnswerWasExpectedAndCallSuccessFunction()");
  #endif    

    //check if there is something to expect
    if(listOfExpectedAnswer.size() > 0)
    {
        std::list<ExpectAnswer>::iterator i = listOfExpectedAnswer.begin();

          #if SHOW_EXPECT_EVENT
            Serial.print("rxPkt: ");
            printApiPacket(rxPkt, "  expect:", KCYN);
          #endif            

        // for all expected answer recorded
        while (i != listOfExpectedAnswer.end())
        {
            byte expectRqType = i->_request[3] & 0x7F;
            if(i->_request[3] == 0x0C ) expectRqType = i->_request[5] & 0x7F;

            //if packet is local
            if(rxPkt[3] != PACKET_REMOTE_ANSWER)
            {
                if((expectRqType | 0x10) == rxPkt[3])
                {
                    #if SHOW_EXPECT_EVENT
                        Serial.println(" = expect local match found ");
                    #endif
                        i->_expect_callback(i->_pNode, rxPkt, true, i->_tag);
                        i=listOfExpectedAnswer.erase(i);
                    #if SHOW_EXPECT_EVENT
                        Serial.println(" = callback done");
                    #endif
    
                    break;
                }
            }

            //since it is remote check the remote packet type futher
            else if((expectRqType | 0x10) == (rxPkt[6] & 0x7F))
            {
              #if SHOW_EXPECT_EVENT
                Serial.println("  = remote packet match");
              #endif


                int len = nodes.getNbBytePacket(i->_pNode,i->_tag);

                //PRTLN("PACKET REMOTE RESP");
                u_mac add_rx;
                add_rx.bOff[byte0]=rxPkt[7];
                add_rx.bOff[byte1]=rxPkt[8];
                add_rx.bOff[byte2]=rxPkt[9];
                add_rx.bOff[byte3]=0;

