Smartrek/spidermesh_gateway_esp32/src/spidermeshapi.cpp
                //Serial.println("  address cmp:" + String(add_rx.address) + "   exp:" + String(i->_pNode.second.mac.address));
                //if address and packet type match, we found the good one
                
                if(add_rx.address== i->_pNode->second.mac.address)
                {
                    //Serial.printf("%s %s == %s %s\n",KGRN,macIntToString(add_rx.address).c_str(), i->_pNode->second.getMacAsString(), KNRM);
                    //Serial.printf("%srxPkt.size()-10 %d==%d len%s\n",KGRN,rxPkt.size()-10, len,KNRM);
                    if(rxPkt.size()-10 == len)
                    {
                    #if SHOW_EXPECT_EVENT
                        Serial.println(" == expect match found");
                    #endif
                        i->_expect_callback(i->_pNode, rxPkt, true, i->_tag);
                        i->_pNode->second.dataValid = 1;
                    #if SHOW_EXPECT_EVENT
                        Serial.println("  data validity TRUE  <----------" + i->_pNode->second.name);
                    #endif
                        i=listOfExpectedAnswer.erase(i);
                        break;
                    }
                    //if mac is same, but packet isn't define, it must be a special request from user
                    else if(len == -1 )
                    {
                        i->_expect_callback(i->_pNode, rxPkt, true, i->_tag);
                        i=listOfExpectedAnswer.erase(i);
                        break;
                    }
                    
                }
            }

            i++;
        }
    }
}


//rfPayloadToJsonFromPacket(i->_idx);



//a chaque EOB, incrémente les compteur de EOB pour tout les nodes qui attende un message. 
//si il a 2 EOB sans réponse, la meme requete peut etre envoyé de nouveau si le nombre de retry est >0
//apres le nombre de retry sans réponse, le node est considéré comme dead
// 

void SpidermeshApi::CheckExpectTimeout()
{
  #if SHOW_EXPECT_EVENT
    //Serial.println("CheckExpectTimeout()"); delay(100);
  #endif
    
    if(listOfExpectedAnswer.size() > 0)
    {
        
        auto i = listOfExpectedAnswer.begin();

        while (i != listOfExpectedAnswer.end())
        {
            //if timeout, when eob more than 2 is considered timeout
            if( (++i->_eob_cnt) >2)
            {
                //Serial.println("Expect failed, reach max EOB");
                i->_eob_cnt=0;

                //retry if less than max allowed and data was valid last time
                //we don't want to retry if it was already dead and waste time here
                apiframe dummy = {};
                PRT(KRED);
                PRT("Timeout occur for node: ");
                PRTLN(i->_pNode->second.getMacAsString());
                PRT(KNRM);

                #if SHOW_EXPECT_EVENT
                Serial.println("  data validity FALSE <---- " + i->_pNode->second.name);
                #endif
                i->_pNode->second.dataValid=0;
                i->_expect_callback(i->_pNode, dummy, false, i->_tag);//if user want to do something

                i=listOfExpectedAnswer.erase(i);
            }
            //Serial.print("  expect list sz:");
            //Serial.println(listOfExpectedAnswer.size());
            if(i != listOfExpectedAnswer.end()) i++;
        }
        
    }
                    
}


void SpidermeshApi::automaticNodePolling()
{
    static bool current_focus_cycle = true;
    static bool toggle_polling=false;
    static NodeIterator_t pNodeToPoll = nodes.pool.begin();

    bool noToPollFound=false;
    toggle_polling = !toggle_polling;    

  #if SHOW_AUTOMATIC_POLLING
    Serial.print("automaticNodePolling() mode:");
    Serial.println(polling_mode);
  #endif
    mesh_t::iterator pPoll = nodes.pool.end();
    //if there are nodes to poll
    if(nodes.pool.size() > 1) //we check if more than one since gateway is the first
    {
        apiframe smkPacket;
        //bool must_increase_polling_iterator = false;

        unsigned long seconds = millis()/1000;

        if(focus_node != 0)
        {
            uint64_t toComp = (millis() - focus_node_start_time)/1000;
            if(toComp < _duration_focus_on_node_polling)
            {
              #if SHOW_AUTOMATIC_POLLING
                Serial.print("focus polling on");
                Serial.println(SmkList::mac2String(focus_node));
              #endif          

                //current_focus_cycle allow to toggle 1/2 time on a specific node 
                //while allowing to continue the round robin cycle on the other 1/2 of time
                if(current_focus_cycle)
                {
                    pPoll = find(focus_node);
                    if(pPoll == nodes.pool.end()) current_focus_cycle = false;
                }
                else
                {
                    if(polling_mode == "time" || polling_mode == "fast")
                    {
                        //must_increase_polling_iterator = true;
                        findNext();
                        pPoll = pCurrentNode;
                    }
                    else pPoll != nodes.pool.end();
                    current_focus_cycle = true;
                }
            }

            //expiration of the focus mode, will return to the programmed polling_mode variable
            else
            {
                focus_node=0;   
                Serial.println("exit focus mode");
            }


        }
        else if(polling_mode == "time")
        {






            fastWhenNoNormal:
            //FAST POLLONG
            if(toggle_polling && (nodes.toPollFaster.size()>0))
            {
                int limitSecurity=nodes.toPollFaster.size();
                do{
                    ++nodes.idxNodeToPollFast;
                    if(nodes.idxNodeToPollFast >= nodes.toPollFaster.size()) nodes.idxNodeToPollFast=0; //round robin fast polling
                    pCurrentNode=nodes.toPollFaster[nodes.idxNodeToPollFast];
                    pPoll = pCurrentNode;
                    
                }while(nodes.toPollFaster[nodes.idxNodeToPollFast]==pNodeToPoll  && --limitSecurity >0);
                nodes.toPollFaster[nodes.idxNodeToPollFast]->second.elapse_time = seconds;
                noToPollFound = true;
                #if SHOW_AUTOMATIC_POLLING
                    Serial.print(KYEL);
                    Serial.println("High priority polling");
                    Serial.print(KNRM);
                #endif   
            }

            //NORMAL POLLING
            else
            {
                for(int i=0; i<nodes.pool.size(); i++)
                {
                    if(++pNodeToPoll == nodes.pool.end()) 
                        pNodeToPoll = nodes.pool.begin();

                    if(nodes.toPollFaster.size()>0)
                    {
                        if(pNodeToPoll->first == nodes.toPollFaster[nodes.idxNodeToPollFast]->first) continue;
                    }

